# Используем образ с веб-сервером Apache и PHP
FROM php:7.4-apache

# Копируем файлы вашего проекта внутрь контейнера
COPY . /var/www/html

# Устанавливаем необходимые расширения PHP (если требуется)
#RUN docker-php-ext-install pdo pdo_mysql

# Опционально: если вам нужно выполнить какие-либо другие команды для настройки контейнера, вы можете добавить их здесь

# Опционально: если вам нужно настроить Apache, вы можете добавить конфигурацию вот так:
# COPY apache-config.conf /etc/apache2/sites-available/000-default.conf
# RUN a2enmod rewrite

# Опционально: если вам нужно настроить работу с базой данных, вы можете добавить поддержку MySQL или другой БД

# Опционально: укажите рабочий каталог, если это необходимо
# WORKDIR /var/www/html

# Опционально: экспонируйте порт, если это необходимо
# EXPOSE 80

# Опционально: запустите какие-либо команды, которые должны быть выполнены при запуске контейнера
# CMD ["php", "-S", "0.0.0.0:80"]

